:PROPERTIES:
:ID:       b0f0bb3f-9b8b-4035-b45f-021299918711
:END:
#+title: Journals: Learning how to sysadmin
#+date: 2022-11-10 14:14:04 +08:00
#+date_modified: 2023-01-15 20:06:33 +08:00
#+language: en


* 2023-01-06

The server is back up and running!

I also added an Atuin sync server especially that I use more often now and slowly needing to sync the history.
While the sync server from the developer is nice, I decided at the end that I would like to manage it for a try.
Fortunately, the service is already available as a NixOS module so there's not much problem there.

Next up, I also replaced the OpenLDAP server to be managed with [[https://github.com/majewsky/portunus][Portunus]] which is already available as a NixOS module.
I haven't tried completely managing it yet, though.
I only scratched the very surface of managing and using LDAP.
I should find out more about it once I continued with my courses I previously mentioned in this journal.

There is another thing which is adding a new component in my server: a nice storage box.
Specifically, I added a storage box from Hetzner which is surprisingly cheap with €4 for a terabyte.
What's more, this storage box has some neat features including an SSH and Borg server.
This instantly replaces my decision to go with a Hetzner storage box instead of Borgbase which is nice but with the budget in mind, I get more mileage from Hetzner's offer.

A complete self-managed setup for €8 a month?
That is very nice especially with a budget.
I'm very satisfied with Hetzner so far.

Even with a meager job pay, my whole setup is quite cheap.
Here's a table of the expenses.

| Thing                    | Expenses (in EUR per month) |
|--------------------------+-----------------------------|
| Hetzner VPS              |                        5.35 |
| Hetzner storage box      |                         3.5 |
| mailbox.org account      |                           3 |
| foodogsquared.one domain |                           2 |
|--------------------------+-----------------------------|
| Total                    |                       13.85 |
#+TBLFM: @>$2=vsum(@I..@-I)


